# PossibleExtrusionAxes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..PossibleExtrusionAxes Property
IFCExtrusionCreationData Class See Also
---
The axes to try when generating the properties of the extrusion.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IFCExtrusionAxes PossibleExtrusionAxes { get; set; }
```

Visual Basic
---
```text
Public Property PossibleExtrusionAxes As IFCExtrusionAxes
	Get
	Set
```

Visual C++
---
```text
public:
property IFCExtrusionAxes PossibleExtrusionAxes {
	IFCExtrusionAxes get ();
	void set (IFCExtrusionAxes value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace